using System;
using System.Collections;
using System.Collections.Generic;
using System.Windows.Data;
class ParameterAllValues
{
	public ParameterName parameterName{get;set;}
	public ParameterType parameterType{get;set;}
	public ParameterSize parameterSize{get;set;}
	public ParameterScale parameterScale{get;set;}
	public ParameterUnit parameterUnit{get;set;}
	public ParameterUnit parameterUnitAlt{get;set;}
	public BitMask bitMask{get;set;}
	public Binding colorBinding{get;set;}
	
	public ParameterValue parameterValue{get;set;}	
	//public List<ParameterValue> parameterValues;
}
class ParameterValue
{
	public int TickTime{get;set;}
	public int TickValue{get;set;}
}
enum ParameterType
{
	неОпределён,
	дискретный,
	аналоговый
}
enum ParameterSize
{
	ОдинБит,
	ДваБайта
}
enum ParameterScale
{
	НеОпределено=-1,
	БезЗапятой=0,
	ОдинЗнакПослеЗапятой,
	ДваЗнакаПослеЗапятой
}
enum ParameterUnit
{
	_,
	В,
	А,
	м3_ч,
	мм_рт_ст,
	мк
}
[Flags]
enum BitMask
{
	None,
	Бит1=0x1,
	Бит2=0x2,
	Бит3=0x4,
	Бит4=0x8,
	Бит5=0x16,
	Бит6=0x32,
	Бит7=0x64,
	Бит8=0x128,
}

enum ParameterName
{
	ТП1=                    0,
	ТП2=					2,
	ТП3=					4,
	ТП4=					6,
	ТП5=					8,
	ТП6=					10,
	ТП7=					12,
	ТП8=					14,
	ТП9=					16,
	ТСМ_0=					18,
	ТП11=					20,
	ТП12=					22,
	ТП13=					24,
	ТП14=					26,
	ТП15=					28,
	ТП16=					30,
	ТП17=					32,
	ТП18=					34,
	ТП19=					36,
	ТСМ_1=					38,
	ТП21=					40,
	ТП22=					42,
	ТСМ_2=					44,
	ТСМ23=					46,
	ТСМ24=					48,
	ТСМ25=					50,
	ТСМ26=					52,
	ТСМ27=					54,
	ТСМ28=					56,
	ТСМ29=					58,
	ТСМ30=					60,
	ТСМ31=					62,
	ТСМ32=					64,
	ТСМ33=					66,
	ТСМ34=					68,
	ТСМ35=					70,
	ТСМ36=					72,
	ТСМ37=					74,
	ТСМ38=					76,
	ТСМ39=					78,
	ТСМ40=					80,
	ДБТ1=					82,
	ДБТ2=					84,
	ДБТ3=					86,
    Iрд=					88,
	Uрд=					90,
	Rплавки=				92,
	Rизол=					94,
	Empty1=					96,
	Empty2=					98,
	CTR_100=				100,
	Метран_2_5=				102,
	ТСМ_41=					104,
	Давление_водооборота=	106,
	Угол_поворота_тигля= 	108,
	Метран_250=				110,
	P_над_поршнем=			112,
	P_под_поршнем=			114,
	Положение_штока=		116,
	Empty3=					118,
	Ток_общ=                120,
	Напряжение_дуги=        122,
	Расход_воды=			124,
	Вакуум=					126,
	Empty4=					128,
	
	Ду500_130_1 =			1301,
	Ду500_130_2 =			1302,
	ДВН1500_130_3 =			1303,
	ДВН1500_130_4 =			1304,
	ДВН3000_130_5 =			1305,
	ДВН3000_130_6 =			1306,
	ARPw_130_7 =			1307,
	ARPw_130_8 =			1308,
	
	SZO_131_1  =			1311,
	SZO_131_2    =			1312,
	Ду160_131_3  =          1313, 
	Ду160_131_4  =          1314,
	Ду160_131_5  =          1315,
	Ду160_131_6  =          1316,
	Ду500_131_7 =	    	1317,
	Ду500_131_8 =			1318,
	
	ДВН1500_132_1 =			1321,
	ДВН1500_132_2 =			1322,
	ДВН3000_132_3 =			1323,
	ДВН3000_132_4 =			1324,
	ARPw_132_5 =			1325,
	ARPw_132_6 =			1326,
	SZO_132_7    =			1327,
	SZO_132_8    =			1328,
	
	Ду160_133_1  =          1331, 
	Ду160_133_2  =          1332,
	Ду160_133_3  =          1333,
	Ду160_133_4  =          1334,
	Ду500_133_5 =  			1335,
	Ду500_133_6 =			1336,
	ДВН1500_133_7 =			1337,
	ДВН1500_133_8 =			1338,
	
	ДВН3000_134_1 =			1341,
	ДВН3000_134_2 =			1342,
	ARPw_134_3 =			1343,
	ARPw_134_4 =			1344,
	SZO_134_5    =			1345,
	SZO_134_6    =			1346,
	Ду160_134_7  =          1347,
	Ду160_134_8  =          1348,

	Ду160_135_1  =          1351,
	Ду160_135_2  =          1352,
	ШтокВВ_135_3  =			1353,
	ШтокВН_135_4  =			1354,
	РПИ1_135_5    =			1355,
	РПИ2_135_6    =			1356,
	РПИ3_135_7    =			1357,
	РПИ4_135_8    =			1358,

	Ду500_авария_175_1 =	1751,
	Ду500_откр_175_2 = 		1752,
	Ду500_закр_175_3 =		1753,
	Ду500_неопредел_175_4= 	1754,

	ДВН1500_авария_176_1 = 	1761,
	ДВН1500_вкл_176_2 =		1762,
	ДВН1500_выкл_176_3 =	1763,
	
	ДВН3000_авария_177_1 =	1771,
	ДВН3000_вкл_177_2 =		1772,
	ДВН3000_выкл_177_3 = 	1773,
	
	ARPw_авария_178_1 =		1781,
	ARPw_вкл_178_2 =		1782,
	ARPw_выкл_178_3 =		1783,
	
	SZO_авария_179_1 = 		1791,
	SZO_вкл_179_2 =			1792,
	SZO_выкл_179_3 = 		1793,
	
	Ду160_авария_180_1 =	1801,
	Ду160_откр_180_2 =		1802,
	Ду160_закр_180_3 = 		1803,
	Ду160_неопредел_180_4 =	1804,
	
	Ду160_авария_181_1 =	1811,
	Ду160_откр_181_2 =		1812,
	Ду160_закр_181_3 = 		1813,
	Ду160_неопредел_181_4 =	1814,

	Ду500_авария_182_1 =	1821,
	Ду500_откр_182_2 =		1822,
	Ду500_закр_182_3 = 		1823,
	Ду500_неопредел_182_4 =	1824,

	ДВН1500_авария_183_1 =	1831,
	ДВН1500_вкл_183_2 =	    1832,
	ДВН1500_выкл_183_3 = 	1833,

	ДВН3000_авария_184_1 =	1841,
	ДВН3000_вкл_184_2 =	    1842,
	ДВН3000_выкл_184_3 = 	1843,

	ARPw_авария_185_1 =		1851,
	ARPw_вкл_185_2 =		1852,
	ARPw_выкл_185_3 = 		1853,
	
	SZO_авария_186_1 = 		1861,
	SZO_вкл_186_2 =			1862,
	SZO_выкл_186_3 = 		1863,

	Ду160_авария_187_1 =	1871,
	Ду160_откр_187_2 =		1872,
	Ду160_закр_187_3 = 		1873,
	Ду160_неопредел_187_4 =	1874,
	
	Ду160_авария_188_1 =	1881,
	Ду160_откр_188_2 =		1882,
	Ду160_закр_188_3 = 		1883,
	Ду160_неопредел_188_4 =	1884,

	Ду500_авария_189_1 =	1891,
	Ду500_откр_189_2 =		1892,
	Ду500_закр_189_3 = 		1893,
	Ду500_неопредел_189_4 =	1894,
	
	ДВН1500_авария_190_1 =	1901,
	ДВН1500_вкл_190_2 =	    1902,
	ДВН1500_выкл_190_3 = 	1903,

	ДВН3000_авария_191_1 =	1911,
	ДВН3000_вкл_191_2 =	    1912,
	ДВН3000_выкл_191_3 = 	1913,
	
	ARPw_авария_192_1 =		1921,
	ARPw_вкл_192_2 =		1922,
	ARPw_выкл_192_3 = 		1923,

	SZO_авария_193_1 = 		1931,
	SZO_вкл_193_2 =			1932,
	SZO_выкл_193_3 = 		1933,

	Ду160_авария_194_1 =	1941,
	Ду160_откр_194_2 =		1942,
	Ду160_закр_194_3 = 		1943,
	Ду160_неопредел_194_4 =	1944,

	Ду160_авария_195_1 =	1951,
	Ду160_откр_195_2 =		1952,
	Ду160_закр_195_3 = 		1953,
	Ду160_неопредел_195_4 =	1954,
	
	Авария_налич_199_1 =	1991,
	Разр_ВВ_199_2 =			1992,
	Звуковая_199_3 =		1993,
	
	РПИ5_200_1 =			2001,
	РПИ6_200_2 =			2002,
	РПИ7_200_3 =			2003,
	РПИ8_200_4 =			2004,
	РПИ9_200_5 =			2005,
	РПИ10_200_6 =			2006,
	РПИ11_200_7 =			2007,
	РПИ12_200_8 =			2008,

	РПИ13_201_1 =			2011,
	РПИ14_201_2 =			2012,
	РПИ15_201_3 =			2013,
	РПИ16_201_4 =			2014,
	ДУ2_201_5 =				2015,
	ДУ2_201_6 =				2016,
	ДУ3_201_7 =				2017,
	ДУ3_201_8 =			    2018,
	
	ДУ4_202_1 =				2021,
	ДУ4_202_2 =				2022,
	ДУ5_202_3 =				2023,
	ДУ5_202_4 =			    2024,
	ДУ6_202_5 =				2025,
	ДУ6_202_6 =			    2026,
	Дверь_Б_202_8 =		    2028,
	
	Нейтраль_203_1=			2031,
	Раб_ВН_203_2=			2032,
	Раб_ВВ_203_3=			2033,
	Марш_ВН_203_4=			2034,
	Марш_ВВ_203_5=			2035,
	КЗ_203_6=				2036,
	Тигель_внизу_203_7=		2037,
	Тигель_вверху_203_8=	2038,
	
	Первый_диапазон_205_1 =	2051,
	Второй_диапазон_205_2=	2052,
	Ошибка_вак_1_205_3=		2053,
	Ошибка_вак_2_205_4=		2054,
	
	Нал_авар_206_1=			2061,
	Изм_авар_сост_206_2=	2062,
	Дверь_бокса_206_3=		2063,
	Ош_кан_тока_206_4=		2064,
	Ош_кан_напр_206_5=		2065,
	Ош_расхода_206_6=		2066,
	Ош_вак_206_7=			2067,
	Вак_откл_206_8=			2068,
	
	Ош_подпорки_207_1=		2071,
	Авария_водооб_207_2=	2072,
	Ош_натекания_207_3=		2073,
	Ош_времени_207_4=		2074,

}
[Flags]
enum DiscreteName130
{
	Ду500_1 = 0x1,
	Ду500_2 =0x2 ,
	ДВН1500_1 = 0x4,
	ДВН1500_2 = 0x8,
	ДВН3000_1 = 0x16,
	ДВН3000_2 =0x32,
	ARPw_1 =0x64,
	ARPw_2 =0x128,
	
}
[Flags]
enum DiscreteName131
{
	SZO_1 = 0x1,
	SZO_2 =0x2 ,
	Ду160_1 = 0x4,
	Ду160_2 = 0x8,
	Ду160_3 = 0x16,
	Ду160_4 =0x32,
	Ду500_1 =0x64,
	Ду500_2 =0x128,
	
}
[Flags]
enum DiscreteName132
{
	ДВН1500_3 = 0x1,
	ДВН1500_4 =0x2 ,
	ДВН3000_3 = 0x4,
	ДВН3000_4 = 0x8,
	ARPw_3 = 0x16,
	ARPw_4 =0x32,
	SZO_3 =0x64,
	SZO_4 =0x128,
	
}
[Flags]
enum DiscreteName133
{
	Ду160_5 = 0x1,
	Ду160_6 =0x2 ,
	Ду160_7 = 0x4,
	Ду160_8 = 0x8,
	Ду500_3 = 0x16,
	Ду500_4 =0x32,
	ДВН1500_5 =0x64,
	ДВН1500_6 =0x128,
	
}
[Flags]
enum DiscreteName134
{
	ДВН3000_5 = 0x1,
	ДВН3000_6 =0x2 ,
	ARPw_5 = 0x4,
	ARPw_6 = 0x8,
	SZO_5 = 0x16,
	SZO_6 =0x32,
	Ду500_5 =0x64,
	Ду500_6 =0x128,
	
}
[Flags]
enum DiscreteName135
{
	Ду160_9 = 0x1,
	Ду160_10 =0x2 ,
	Ду160_11 = 0x4,
	Ду160_12 = 0x8,
	Ду500_6  = 0x16,
	Ду500_7 =0x32,
	ДВН1500_7 =0x64,
	ДВН1500_8 =0x128,
	
}
[Flags]
enum DiscreteName175
{
	Ду500_авария = 0x1,
	Ду500_откр =0x2 ,
	Ду500_закр = 0x4,
	Ду500_неопредел = 0x8,
	Ду500_6  = 0x16,
	Ду500_7 =0x32,
	ДВН1500_7 =0x64,
	ДВН1500_8 =0x128,
	
}
[Flags]
enum DiscreteName176
{
	ДВН1500_авария = 0x1,
	ДВН1500_вкл =0x2 ,
	ДВН1500_выкл = 0x4,
}
[Flags]
enum DiscreteName177
{
	ДВН3000_авария = 0x1,
	ДВН3000_вкл =0x2 ,
	ДВН3000_выкл = 0x4,
}
[Flags]
enum DiscreteName178
{
	ARPw_авария = 0x1,
	ARPw_вкл =0x2 ,
	ARPw_выкл = 0x4,
}
[Flags]
enum DiscreteName179
{
	SZO_авария = 0x1,
	SZO_вкл =0x2 ,
	SZO_выкл = 0x4,
}
[Flags]
enum DiscreteName180
{
	Ду160_авария = 0x1,
	Ду160_откр =0x2 ,
	Ду160_закр = 0x4,
	Ду160_неопредел = 0x8,
}
[Flags]
enum DiscreteName181
{
	Ду160_авария = 0x1,
	Ду160_откр =0x2 ,
	Ду160_закр = 0x4,
	Ду160_неопредел = 0x8,
}